Revit 2024 API
Zone.GetDomainData Method
 Gets the domain data for the zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ZoneElementDomainData GetDomainData()
Visual Basic
Public Function GetDomainData As ZoneElementDomainData
Visual C++
public:
ZoneElementDomainData^ GetDomainData()
Return Value
 Returns a pointer to the base class for specific domain requirements for the zone.
See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace